app/controllers/annots_controller.rb

  def show
    @annot = Annot.find(params[:id])
---
SELECT * FROM `annots` WHERE (`annots`.`id` = 1)

  def create
    @annot = Annot.new(params[:annot])

    respond_to do |format|
      if @annot.save
---
INSERT INTO `annots` (`created_at`, `updated_at`, `shape`, `type`, `props`) VALUES('2011-04-30 22:08:20', '2011-04-30 22:08:20', 'circle', NULL, 'rx:50,ry:36,cx:147.38330078125,cy:432.1666717529297,fill:red,opacity:0.5')