app/controllers/gardens_controller.rb

SELECT * FROM `gardens` WHERE (`gardens`.`id` = 1)
---
  def show
    @garden = Garden.find(params[:id])

SELECT * FROM `gardens` WHERE (`gardens`.`id` = 1)
---
  def edit
    @garden = Garden.find(params[:id])

INSERT INTO `gardens` (`name`, `created_at`, `updated_at`, `notes`) VALUES('test3', '2011-05-01 10:40:23', '2011-05-01 10:40:23', NULL)
---
  def create
    @garden = Garden.new(params[:garden])

    respond_to do |format|
      if @garden.save

SELECT * FROM `gardens` WHERE (`gardens`.`id` = 1)
UPDATE `gardens` SET `updated_at` = '2011-04-30 21:30:03', `notes` = 'test' WHERE `id` = 1
---
  def update
    @garden = Garden.find(params[:id])

    respond_to do |format|
      if @garden.update_attributes(params[:garden])