app/controllers/logentries_controller.rb

  def show
    @logentry = Logentry.find(params[:id])
---
SELECT * FROM `logentries` WHERE (`logentries`.`id` = 2)

  def new
    @plant = Plant.find(params[:plant_id])
---
SELECT * FROM `plants` WHERE (`plants`.`id` = 1)

  def edit
    @logentry = Logentry.find(params[:id])
---
SELECT * FROM `logentries` WHERE (`logentries`.`id` = 3)

  def create
	@plant = Plant.find(params[:plant_id])
    @logentry = @plant.logentries.create(params[:logentry])
---
SELECT * FROM `plants` WHERE (`plants`.`id` = 1)
INSERT INTO `logentries` (`created_at`, `notes`, `updated_at`, `plant_id`, `logdate`) VALUES('2011-04-25 12:08:11', 'test', '2011-04-25 12:08:11', 1, '2011-04-25')

  def update
    @logentry = Logentry.find(params[:id])

    if @logentry.update_attributes(params[:logentry])
---
SELECT * FROM `logentries` WHERE (`logentries`.`id` = 3)
UPDATE `logentries` SET `updated_at` = '2011-04-25 13:36:30', `notes` = 'test3' WHERE `id` = 3

  def destroy
    @logentry = Logentry.find(params[:id])
    @plant = @logentry.plant
    @logentry.destroy
---
SELECT * FROM `logentries` WHERE (`logentries`.`id` = 1)
DELETE FROM `logentries` WHERE `id` = 1