app/controllers/plants_controller.rb

  def index
    @plants = Plant.find(:all, :order=> 'name')
    if Garden.find(:all).count == 0
    	Garden.create
    end
    @garden = Garden.find(params[:garden_id])
---
INSERT INTO `gardens` (`name`, `created_at`, `updated_at`) VALUES(NULL, '2011-04-29 19:14:27', '2011-04-29 19:14:27')
SELECT * FROM `gardens` WHERE (`gardens`.`id` = 1)

  def show
    @plant = Plant.find(params[:id])
---
SELECT * FROM `plants` WHERE (`plants`.`id` = 1)

  def edit
    @plant = Plant.find(params[:id])
---
SELECT * FROM `plants` WHERE (`plants`.`id` = 1)

  def create
    @garden = Garden.find(params[:garden_id])
    @plant = @garden.plants.new(params[:plant])

      if @plant.save
---
SELECT * FROM `gardens` WHERE (`gardens`.`id` = 1)
INSERT INTO `plants` (`name`, `created_at`, `notes`, `updated_at`, `garden_id`, `where`, `variety`) VALUES('test', '2011-05-01 10:53:53', '', '2011-05-01 10:53:53', 1, NULL, '')

  def update
    @plant = Plant.find(params[:id])

      if @plant.update_attributes(params[:plant])
---
SELECT * FROM `plants` WHERE (`plants`.`id` = 1)
UPDATE `plants` SET `updated_at` = '2011-04-25 16:59:23', `notes` = 'fddf\r\ndf\r\ndf\r\ndfa' WHERE `id` = 7

  def destroy
    @plant = Plant.find(params[:id])
    @garden = @plant.garden
    @plant.destroy
---
SELECT * FROM `plants` WHERE (`plants`.garden_id = 1)
DELETE FROM `plants` WHERE `id` = 3